const jobs = {
  generalInformation: {
    userName: 'Смирнова Екатерина Александровна',
    mainInfo: 'Женщина, 34 года, родилась 10 января 1989',
    contactInfo: {
      email: 'trililium@yandex.com',
    },
  },
  expectations: {
    expectedProfession: ['QA engineer', 'тестировщик'],
    specializations: ['Инженер по качеству', 'Тестировщик'],
    employment: ['полная занятость'],
    workSchedule: ['полный день', 'удаленная работа'],
  },
  workExperience: [
    {
      companyName: 'ООО "Айти Авиа"',
      workPeriod: 'Март 2023 — май 2023',
      companyUrl: 'www.itavia.ru/',
      position: 'Инженер по контролю качества программного обеспечения',
      workPerformed:
        '<span>- Создание документации,<br>- описание проектов, <br>- создание тест-кейсов,<br>- тестирование, описание багов,<br>- создание автотестов на cypress + js;<br>- сборка, деплой, релиз,<br>- анализ логов в seq.</span>',
    },
    {
      companyName: 'ООО Интенса',
      workPeriod: 'Сентябрь 2021 — апрель 2022',
      companyUrl: 'intensa.ru/',
      position: 'Старший тестировщик',
      workPerformed:
        '<span>- Написание чек-листов, тест-кейсов, баг-репортов;<br>- Проведение функционального, регрессионного, кроссбраузерного тестирования, тестирование UI, API (REST), верстки, backend (инсталляционное тестирование модуля, вывод логов, интеграция модуля mindbox c битрикс);<br>- описание особенностей проектов;<br>- уточнение требований по документации;<br>- корректировка задач для тестировщиков;<br>- создание скриптов на js для выполнения в консоли веб браузера (сверка текста, вывод данных по элементам, devtools + JavaScript), небольших инструментов типа отправщика писем (node js + nodemailer + express) для проверки верстки писем;<br>- участие в поиске второго тестировщика, проведение собеседования, обучение;<br>- построение тестирования с нуля (до этого в организации тестировщиков не было).<br>- подготовка демонстрационного проекта на Cypress (End-to-end тесты).<br>Инструменты:<br>- автотесты ghost inspector, cypress, javascript, node js;<br>- (ручное тестирование) browserstack, devtools (lighthouse, elements, console, sources, networks, device toolbar, perfect pixel), postman, SQL, собственные скрипты для ускорения проверки всей страницы.</span>',
    },
    {
      companyName: 'ООО Выберу.ру',
      workPeriod: 'Март 2020 — июль 2021',
      companyUrl: 'vbr.ru',
      position: 'Тестировщик ПО',
      workPerformed:
        '<span>Написание чек-листов, баг репортов, тест-кейсов, проведение функционального, регрессионного, кроссбраузерного, UI тестирования, автотесты на связке C# + Selenoid + Selenium + паттерн Page Object (End-to-end тесты). <br>4 месяца QA lead (2 тестировщика). Отчет во время созвонов о команде, распределение задач, определение необходимых автотестов для проекта, расписывание автотестов для тестеров, создание хелперов для уменьшение количества единообразного кода, обучение нового сотрудника. <br>Тестируемый проект банковский агрегатор: </span>',
    },
    {
      companyName: 'ООО "Атбит"',
      workPeriod: 'Октябрь 2017 — март 2018',
      companyUrl: 'www.atbit.ru/',
      position: 'Специалист технической поддержки',
      workPerformed: `<span>- Помощь пользователям при работе с доработанной конфигурацией "Управление торговлей";
      <br>- анализ ошибок пользователей при работе с ПО;
      <br>- исправление небольших багов, связанных с доработками и переходом на новую версию конфигурации;
      <br>- небольшие доработки для удобства пользователей;
      <br>- написание инструкций для пользователей.</span>`,
    },
    {
      companyName: 'ООО "АйТи Тест"',
      workPeriod: 'Июнь 2017 — сентябрь 2017',
      companyUrl: '',
      position: 'Инженер-тестировщик',
      workPerformed: `<span>- работа со снифферами (Fiddler, Charles)
      <br>- анализ сетевого трафика, подмена запросов и ответов;
      <br>- сбор логов через Android Studio (ADM);
      <br>- работа с инструментами разработчика браузеров;
      <br>-написание чек-листов;
      <br>-оформление багов в багтрекере Redmine;
      <br>-написание тест-кейсов;
      <br>
      <br>При тестировании сайта использовались следующие виды тестирования:
      <br>-функциональное;
      <br>-регрессионное.
      <br>
      <br>Организация команды при тестировании, участие в обсуждении работ с менеджером и программистом, предоставление актуальной информации о состоянии проекта.</span>`,
    },
    {
      companyName: '',
      workPeriod: '',
      companyUrl: '',
      position: '',
      workPerformed: '',
    },
  ],
  keySkills: [
    'Тестирование',
    'Функциональное тестирование',
    'HTML',
    'CSS',
    'Postman',
    'SQL',
    'JavaScript',
    'Git',
    'Cypress',
    'REST',
    'JSON',
  ],
  aboutMe: `<span>Есть небольшой опыт работы с Cypress (язык программирования javascript).<br>Немного знакома с js, css, html.<br></span>`,
};
